# 五言绝句：j5
# 七言绝句：j7

poems = {
    '登鸛雀樓': {
        'type_id': 'j5',
        'type': '五言絕句',
        'title': '登鸛雀樓',
        'author': '王之渙',
        'content': '白日依山盡，黃河入海流。欲窮千里目，更上一層樓。',  # pushButton.setText('白')
        'sounds': [
            '白[baak6]',
            '日[jat6]',
            '依[ji1]',
            '山[saan1]',
            '盡[zeon6]',
            '登鶴雀樓-1',
            '黃[wong4]',
            '河[ho4]',
            '入[jap6]',
            '海[hoi2]',
            '流[lau4]',
            '登鶴雀樓-2',
            '欲[juk6]',
            '窮[kung4]',
            '千[cin1]',
            '里[lei5]',
            '目[muk6]',
            '登鶴雀樓-3',
            '更[gang3]',
            '上[soeng5]',
            '一[jat1]',
            '層[cang4]',
            '樓[lau4]',
            '登鶴雀樓-4'
        ]
    },
    '靜夜思': {
       'type_id': 'j5',
        'type': '五言絕句',
        'title': '靜夜思',
        'author': '李白',
        'content': '床前明月光，疑似地上霜。舉頭望明月，低頭思故鄉。',
    },
    '涼州詞': {
        'type_id': 'j7',
        'type': '七言絕句',
        'title': '涼州詞',
        'author': '王翰',
        'content': '葡萄美酒夜光杯，欲飲琵琶馬上催。醉臥沙場君莫笑，古來征戰幾人回。',
    },
}

page_id = {
    'j5': 0,
    'j7': 1,
    'l5': 2,
    'l7': 2,
}